zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/MC56F80748/drivers/fsl_sim.h
/*! @brief The enumeration of dma operation mode, this enumeration can be used to disable/enable DMA module in different
   power modes. */
typedef enum _sim_dma_operation_mode
{
    kSIM_DMADisable                 = 0U, /*!< DMA module is disabled. */
    kSIM_DMAEnableAtRunModeOnly     = 1U, /*!< DMA module is enabled in run mode only. */
    kSIM_DMAEnableAtRunModeWaitMode = 2U, /*!< DMA module is enabled in run and wait modes only. */
    kSIM_DMAEnableAtAllPowerModes   = 3U, /*!< DMA module is enabled in all power modes. */
    kSIM_DMADisableWriteProtect     = 4U, /*!< DMA module is disabled and the related register bit field is write
                                                protected until the next reset. */
    kSIM_DMAEnableAtRunModeOnlyWriteProtect = 5U, /*!< DMA module is enabled in run mode only and the related bit field
                                                    is write protected until the next reset. */
    kSIM_DMAEnableAtRunModeWaitModeWriteProtect = 6U, /*!< DMA module is enabled in run and wait modes only and the
                                                        related register bit field is write protected until the next
                                                        reset. */
    kSIM_DMAEnableAtAllPowerModesWriteProtect = 7U,   /*!< DMA module is enabled in all low power modes and the related
                                                          register bit field is write protected until the next reset. */
} sim_dma_operation_mode_t;

/*!
 * @brief The enumeration of small regualtor 1P2V control mode, such as normal mode and standby mode.
 */
typedef enum _sim_small_regulator_1P2V_control_mode
{
    kSIM_SmallRegulator1P2VInNormalMode             = 0U, /*!< Small regulator 1.2V supply placed in normal mode. */
    kSIM_SmallRegulator1P2VInStandbyMode            = 1U, /*!< Small regulator 1.2V supply placed in standby mode. */
    kSIM_SmallRegulator1P2VInNormalModeWriteProtect = 2U, /*!< Small regulator 1.2V supply placed in nomal mode, and the
                                                       related register bit field is write protected until the next
                                                        reset. */
    kSIM_SmallRegulator1P2VInStandbyModeWriteProtect = 3U, /*!< Small regulator 1.2V supply placed in standby mode, and
                                                        the related register bit field is write protected until the next
                                                        reset. */
} sim_small_regulator_1P2V_control_mode_t;

/*!
 * @brief The enumeration of small regulator 2P7V control mode, such as normal mode, standby mode, powerdown mode, etc.
 */
typedef enum _sim_small_regulator_2P7V_control_mode
{
    kSIM_SmallRegulator2P7VInNormalMode             = 0U, /*!< Small regulator 2.7V supply placed in normal mode. */
    kSIM_SmallRegulator2P7VInStandbyMode            = 1U, /*!< Small regulator 2.7V supply placed in standby mode. */
    kSIM_SmallRegulator2P7VInPowerdownMode          = 4U, /*!< Small regulator 2.7V supply placed in powerdown mode. */
    kSIM_SmallRegulator2P7VInNormalModeWriteProtect = 2U, /*!< Small regulator 2.7V supply placed in normal mode and the
                                                            related bit field is write protected until chip reset. */
    kSIM_SmallRegulator2P7VInStandbyModeWriteProtect = 3U, /*!< Small regulator 2.7V supply placed in standby mode and
                                                                the related bit field is write protected until chip
                                                                reset. */
    kSIM_SmallRegulator2P7VInPowerdownModeWriteProtect = 0xCU, /*!< Small regulator placed in powerdown mode and the
                                                               related bit field is write protected until chip reset. */
} sim_small_regulator_2P7V_control_mode_t;

/*!
 * @brief The enumeration of large regulator contorl mode, such as normal mode, standby mode.
 */
typedef enum _sim_large_regulator_control_mode
{
    kSIM_LargeRegulatorInNormalMode             = 0U,  /*!< Large regulator placed in normal mode. */
    kSIM_LargeRegulatorInStandbyMode            = 1U,  /*!< Large regulator placed in standby mode. */
    kSIM_LargeRegulatorInNormalModeWriteProtect = 2U,  /*!< Large regulator placed in normal mode, and the related
                                                       register  bit field is write protected until chip reset. */
    kSIM_LargeRegulatorInStandbyModeWriteProtect = 3U, /*!< Large regulator placed in standby mode, and the related
                                                       register bit field is write protected until chip reset. */
} sim_large_regulator_control_mode_t;

/*!
 * @brief The enumeration of modules that support various protection mode.
 */
typedef enum _sim_write_protection_module
{
    kSIM_GPIOInternalPeripheralSelectProtection = 0U, /*!< Used to control the protection mode GPSn and
                                                                    IPSn registers in the SIM, all XBAR, EVTG,
                                                                    GPIOn_PER, GPIOn_PPMODE, GPIOn_DRIVE. */
    kSIM_PeripheralClockEnableProtection = 2U,        /*!< Used to control the protection mode of PCEn, SDn,
                                                                          PSWRn, and PCR register. */
    kSIM_GPIOPortDProtection = 4U,                    /*!< Used to control the protection mode of GPIO_D_PER,
                                                                         GPIO_D_PPMODE, and GPIO_D_DRIVE register. */
    kSIM_PowerModeControlWriteProtection = 6U,        /*!< Used to control the protection mode of the PWRMODE
                                                                           register. */
} sim_write_protection_module_t;

/*! @brief The enumeration of write protection mode, such as write protection off, write protection on, etc. */
typedef enum _sim_write_protection_mode
{
    kSIM_WriteProtectionOff          = 0U, /*!< Write protection off. */
    kSIM_WriteProtectionOn           = 1U, /*!< Write protection on. */
    kSIM_WriteProtectionOffAndLocked = 2U, /*!< Write protection off and locked until chip reset. */
    kSIM_WriteProtectionOnAndLocked  = 3U  /*!< Write protection on and locked until chip reset. */
} sim_write_protection_mode_t;

/*!
 * @brief The enumeration of lpi2c trigger selection, including slave trigger and master trigger.
 */
typedef enum _sim_lpi2c_trigger_selection
{
    kSIM_Lpi2cSlaveTrigger  = 0U, /*!< Selects slave trigger. */
    kSIM_Lpi2cMasterTrigger = 1U, /*!< Selects master trigger. */
} sim_lpi2c_trigger_selection_t;

/*!
 * @brief The enumeration of device operate mode, including normal mode and fast mode.
 */
typedef enum _sim_device_operate_mode
{
    kSIM_NormalOperateMode = 0U, /*!< Device in normal operating mode, core:bus:flash frequency as 2:2:1 */
    kSIM_FastOperateMode   = 1U, /*!< Device in fast operate mode, core:bus:flash frequency as 4:4:1 */
} sim_device_operate_mode_t;

/*!
 * @brief The enumeration of master pit.
 */
typedef enum _sim_master_pit_selection
{
    kSIM_PIT0MasterPIT1Slave = 0U, /*!< PIT0 is master PIT and PIT1 is slave PIT. */
    kSIM_PIT1MasterPIT0Slave = 1U, /*!< PIT0 is master PIT and PIT1 is slave PIT. */
} sim_master_pit_selection_t;

/*!
 * @brief The enumeration of XBAR input.
 */
typedef enum _sim_xbar_input
{
    kSIM_XBARInput2 = 0U, /*!< XBAR Input 2. */
    kSIM_XBARInput3 = 1U, /*!< XBAR Input 3. */
    kSIM_XBARInput4 = 2U, /*!< XBAR Input 4. */
    kSIM_XBARInput5 = 3U, /*!< XBAR Input 5. */
    kSIM_XBARInput6 = 4U, /*!< XBAR Input 6. */
    kSIM_XBARInput7 = 5U, /*!< XBAR Input 7. */
    kSIM_XBARInput8 = 6U, /*!< XBAR Input 8. */
    kSIM_XBARInput9 = 7U, /*!< XBAR Input 9. */
} sim_xbar_input_t;

/*!
 * @brief The enumeration of XBAR filter count.
 */
typedef enum _sim_xbar_filter_count
{
    kSIM_XBARFilter3Count  = 0U, /*!< 3 consecutive sample must agree. */
    kSIM_XBARFilter4Count  = 1U, /*!< 4 consecutive sample must agree. */
    kSIM_XBARFilter5Count  = 2U, /*!< 5 consecutive sample must agree. */
    kSIM_XBARFilter6Count  = 3U, /*!< 6 consecutive sample must agree. */
    kSIM_XBARFilter7Count  = 4U, /*!< 7 consecutive sample must agree. */
    kSIM_XBARFilter8Count  = 5U, /*!< 8 consecutive sample must agree. */
    kSIM_XBARFilter9Count  = 6U, /*!< 9 consecutive sample must agree. */
    kSIM_XBARFilter10Count = 7U, /*!< 10 consecutive sample must agree. */
} sim_xbar_filter_count_t;

