zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/MC56F80748/drivers/fsl_sim.h
static inline void SIM_SetLPI2C0TriggerSelection(SIM_Type *base, sim_lpi2c_trigger_selection_t eTriggerSelection)
{
    if (eTriggerSelection == kSIM_Lpi2cSlaveTrigger)
    {
        base->MISC0 &= ~SIM_MISC0_LPI2C0_TRIG_SEL_MASK;
    }
    else
    {
        base->MISC0 |= SIM_MISC0_LPI2C0_TRIG_SEL_MASK;
    }
}

/*!
 * @brief Gets device currently operate mode, the possible result is normal operate mode or fast operate mode.
 *
 * @param base SIM peripheral base address.
 * @return Current device's operate mode.
 */
static inline sim_device_operate_mode_t SIM_GetDeviceOperateMode(SIM_Type *base)
{
    return (sim_device_operate_mode_t)(uint16_t)((base->MISC0 & SIM_MISC0_MODE_STAT_MASK) >> SIM_MISC0_MODE_STAT_SHIFT);
}

/*!
 * @brief Enables/Disables the ADC scan control register reorder feature.
 *
 * @param base SIM peripheral base address.
 * @param bEnable Used to control the ADC scan control register reorder feature.
 *              - \b true Enable the re-ordering of ADC scan control bits.
 *              - \b false ADC scan control register works in normal order.
 */
static inline void SIM_EnableADCScanControlReorder(SIM_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->MISC0 |= SIM_MISC0_SCTRL_REORDER_MASK;
    }
    else
    {
        base->MISC0 &= ~SIM_MISC0_SCTRL_REORDER_MASK;
    }
}

/*!
 * @brief Sets master programmable interval timer
 *
 * @param base SIM peripheral base address.
 * @param eMasterPit The master PIT to be selected, please refer to @ref sim_master_pit_selection_t.
 */
static inline void SIM_SetMasterPIT(SIM_Type *base, sim_master_pit_selection_t eMasterPit)
{
    if (eMasterPit == kSIM_PIT0MasterPIT1Slave)
    {
        base->MISC0 &= ~SIM_MISC0_PIT_MSTR_MASK;
    }
    else
    {
        base->MISC0 |= SIM_MISC0_PIT_MSTR_MASK;
    }
}

/*! @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_SIM_H_*/
